## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 21 to change, 4 to destroy.</code></pre>

* Create
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;01&#34;]
  * local_file.config[&#34;02&#34;]
* Update
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td&#34;]
* Replace
  * azurerm_storage_container.xcutting[&#34;01-db-ack-checkpoint&#34;]
  * azurerm_storage_container.xcutting[&#34;01-db-rsp-checkpoint&#34;]
  * azurerm_storage_container.xcutting[&#34;02-db-ack-checkpoint&#34;]
  * azurerm_storage_container.xcutting[&#34;02-db-rsp-checkpoint&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_function_app.example["00-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox00-uks-dlrm-01"
        name                                           = "af-aplfpa-sbox00-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest00externalsbox" -> "ingest00xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox00-uks-dlrm-01"
        name                                           = "af-aplfta-sbox00-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest00externalsbox" -> "ingest00xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox00-uks-dlrm-01"
        name                                           = "af-apluta-sbox00-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest00externalsbox" -> "ingest00xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox00-uks-dlrm-01"
        name                                           = "af-bails-sbox00-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest00externalsbox" -> "ingest00xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox00-uks-dlrm-01"
        name                                           = "af-joh-sbox00-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest00externalsbox" -> "ingest00xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox00-uks-dlrm-01"
        name                                           = "af-sbails-sbox00-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest00externalsbox" -> "ingest00xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-td-sbox00-uks-dlrm-01"
        name                                           = "af-td-sbox00-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest00externalsbox" -> "ingest00xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox01-uks-dlrm-01"
        name                                           = "af-aplfpa-sbox01-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest01externalsbox" -> "ingest01xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox01-uks-dlrm-01"
        name                                           = "af-aplfta-sbox01-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest01externalsbox" -> "ingest01xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox01-uks-dlrm-01"
        name                                           = "af-apluta-sbox01-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest01externalsbox" -> "ingest01xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox01-uks-dlrm-01"
        name                                           = "af-bails-sbox01-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest01externalsbox" -> "ingest01xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox01-uks-dlrm-01"
        name                                           = "af-joh-sbox01-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest01externalsbox" -> "ingest01xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox01-uks-dlrm-01"
        name                                           = "af-sbails-sbox01-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest01externalsbox" -> "ingest01xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-td-sbox01-uks-dlrm-01"
        name                                           = "af-td-sbox01-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest01externalsbox" -> "ingest01xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox02-uks-dlrm-01"
        name                                           = "af-aplfpa-sbox02-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest02externalsbox" -> "ingest02xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox02-uks-dlrm-01"
        name                                           = "af-aplfta-sbox02-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest02externalsbox" -> "ingest02xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox02-uks-dlrm-01"
        name                                           = "af-apluta-sbox02-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest02externalsbox" -> "ingest02xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox02-uks-dlrm-01"
        name                                           = "af-bails-sbox02-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest02externalsbox" -> "ingest02xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox02-uks-dlrm-01"
        name                                           = "af-joh-sbox02-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest02externalsbox" -> "ingest02xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox02-uks-dlrm-01"
        name                                           = "af-sbails-sbox02-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest02externalsbox" -> "ingest02xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (12 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-td-sbox02-uks-dlrm-01"
        name                                           = "af-td-sbox02-uks-dlrm-01"
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "ingest02externalsbox" -> "ingest02xcuttingsbox"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_storage_container.xcutting["01-db-ack-checkpoint"] must be replaced
-/+ resource "azurerm_storage_container" "xcutting" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://ingest01externalsbox.blob.core.windows.net/db-ack-checkpoint" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "db-ack-checkpoint"
      ~ resource_manager_id               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest01externalsbox/blobServices/default/containers/db-ack-checkpoint" -> (known after apply)
      ~ storage_account_name              = "ingest01externalsbox" -> "ingest01xcuttingsbox" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_container.xcutting["01-db-rsp-checkpoint"] must be replaced
-/+ resource "azurerm_storage_container" "xcutting" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://ingest01externalsbox.blob.core.windows.net/db-rsp-checkpoint" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "db-rsp-checkpoint"
      ~ resource_manager_id               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest01externalsbox/blobServices/default/containers/db-rsp-checkpoint" -> (known after apply)
      ~ storage_account_name              = "ingest01externalsbox" -> "ingest01xcuttingsbox" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_container.xcutting["02-db-ack-checkpoint"] must be replaced
-/+ resource "azurerm_storage_container" "xcutting" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://ingest02externalsbox.blob.core.windows.net/db-ack-checkpoint" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "db-ack-checkpoint"
      ~ resource_manager_id               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest02externalsbox/blobServices/default/containers/db-ack-checkpoint" -> (known after apply)
      ~ storage_account_name              = "ingest02externalsbox" -> "ingest02xcuttingsbox" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_container.xcutting["02-db-rsp-checkpoint"] must be replaced
-/+ resource "azurerm_storage_container" "xcutting" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://ingest02externalsbox.blob.core.windows.net/db-rsp-checkpoint" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "db-rsp-checkpoint"
      ~ resource_manager_id               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest02externalsbox/blobServices/default/containers/db-rsp-checkpoint" -> (known after apply)
      ~ storage_account_name              = "ingest02externalsbox" -> "ingest02xcuttingsbox" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["01"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "01"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_01.json"
      + id                   = (known after apply)
    }

  # local_file.config["02"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "02"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_02.json"
      + id                   = (known after apply)
    }

Plan: 7 to add, 21 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":83,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->